{
    "architectures": [
        "BailingMoeV2ForCausalLM"
    ],
    "attention_dropout": 0.0,
    "auto_map": {
        "AutoConfig": "configuration_bailing_moe_v2.BailingMoeV2Config",
        "AutoModel": "modeling_bailing_moe_v2.BailingMoeV2Model",
        "AutoModelForCausalLM": "modeling_bailing_moe_v2.BailingMoeV2ForCausalLM"
    },
    "num_hidden_layers": 80,
    "hidden_size": 8192,
    "intermediate_size": 18432,
    "eos_token_id": 156892,
    "pad_token_id": 156892,
    "first_k_dense_replace": 4,
    "hidden_act": "silu",
    "max_position_embeddings": 32768,
    "model_type": "bailing_moe",
    "moe_intermediate_size": 2048,
    "norm_topk_prob": true,
    "num_experts_per_tok": 8,
    "num_attention_heads": 64,
    "norm_head": false,
    "num_experts": 256,
    "num_key_value_heads": 8,
    "rope_theta": 600000,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.52.3",
    "use_bias": false,
    "use_rmsnorm": true,
    "rms_norm_eps": 1e-06,
    "head_dim": 128,
    "num_shared_experts": 1,
    "use_cache": true,
    "use_qkv_bias": false,
    "embedding_dropout": 0.0,
    "norm_softmax": false,
    "output_dropout": 0.0,
    "vocab_size": 157184,
    "rotary_dim": 64,
    "using_split_qkv_in_self_attention": false,
    "router_dtype": "fp32",
    "moe_router_enable_expert_bias": true,
    "routed_scaling_factor": 2.5,
    "n_group": 8,
    "topk_group": 4,
    "use_qk_norm": true,
    "score_function": "sigmoid"
}
