{
    "model_version": "HunyuanImage-3.0",
    "add_classification_head": false,
    "anyres_pooling_size": 2,
    "anyres_vit_max_image_size": null,
    "anyres_vit_two_views": false,
    "architectures": [
        "HunyuanImage3ForCausalMM"
    ],
    "auto_map": {
        "AutoConfig": "configuration_hunyuan.HunyuanImage3Config",
        "AutoModel": "hunyuan.HunyuanImage3Model",
        "AutoModelForCausalLM": "hunyuan.HunyuanImage3ForCausalMM"
    },
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attention_head_dim": 128,
    "bos_token_id": 127958,
    "cla_share_factor": 2,
    "class_num": 0,
    "dense_list": [
        4096,
        0
    ],
    "eod_token_id": 3,
    "eos_token_id": 127957,
    "group_limited_greedy": false,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "im_end_id": 128001,
    "im_newline_id": 11,
    "im_start_id": 128000,
    "image_token_id": 128006,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "kv_lora_rank": null,
    "mask_init_id": 12,
    "max_position_embeddings": 22800,
    "mlp_bias": false,
    "model_type": "hunyuan_image_3_moe",
    "moe_drop_tokens": false,
    "moe_intermediate_size": [
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072,
        3072
    ],
    "moe_layer_num_skipped": 0,
    "moe_random_routing_dropped_token": false,
    "moe_topk": [
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8,
        8
    ],
    "n_group": false,
    "norm_topk_prob": true,
    "norm_type": "rms",
    "num_attention_heads": 32,
    "num_experts": 64,
    "num_hidden_layers": 32,
    "num_key_value_heads": 8,
    "num_media_embeds": 257,
    "num_shared_expert": [
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1
    ],
    "pad_id": 128009,
    "pad_token_id": 128009,
    "pool_type": "last",
    "position_embedding_xdrope": false,
    "pretraining_tp": 1,
    "q_lora_rank": null,
    "qk_nope_head_dim": null,
    "qk_rope_head_dim": null,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
        "alpha": 1.0,
        "beta_fast": 32,
        "beta_slow": 1,
        "factor": 1.0,
        "mscale": 1.0,
        "mscale_all_dim": 1.0,
        "type": "custom"
    },
    "rope_theta": 10000.0,
    "routed_scaling_factor": false,
    "skip_cls_token": false,
    "text_end_id": 7,
    "text_start_id": 6,
    "tie_word_embeddings": false,
    "topk_group": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.50.0",
    "use_cache": true,
    "use_cla": false,
    "use_mixed_mlp_moe": true,
    "use_mla": false,
    "use_qk_norm": true,
    "use_rotary_pos_emb": true,
    "v_head_dim": null,
    "video_end_id": 10,
    "video_start_id": 9,
    "vit_add_patchemb_bias": false,
    "vit_input_resolution": 224,
    "vit_mapping_type": "resampler",
    "vit_norm_type": "fused",
    "vit_patch": 1,
    "vit_path": null,
    "vit_remove_prenorm": false,
    "vit_token": 64,
    "vit_type": "siglip2-so400m-patch16-naflex",
    "vit_used_rms_norm": false,
    "vocab_size": 133120,
    "xdrope_section": null,
    "head_dim": 128,
    "rope_type": "2d",
    "vae_downsample_factor": [
        16,
        16
    ],
    "vit_downsample_factor": [
        16,
        16
    ],
    "cond_token_attn_type": "joint_full",
    "cond_image_type": "vae_vit",
    "vae_type": "hunyuan-image-vae-v1",
    "vae_dtype": "float32",
    "vae_autocast_dtype": "float16",
    "image_base_size": 1024,
    "vae": {
        "_class_name": "AutoencoderKLConv3D",
        "block_out_channels": [
            128,
            256,
            512,
            1024,
            1024
        ],
        "in_channels": 3,
        "out_channels": 3,
        "latent_channels": 32,
        "layers_per_block": 2,
        "ffactor_spatial": 16,
        "ffactor_temporal": 4,
        "sample_size": 384,
        "sample_tsize": 96,
        "downsample_match_channel": true,
        "upsample_match_channel": true,
        "scaling_factor": 0.562679178327931
    },
    "vit": {
        "_attn_implementation": "sdpa",
        "attention_dropout": 0.0,
        "hidden_act": "gelu_pytorch_tanh",
        "hidden_size": 1152,
        "intermediate_size": 4304,
        "layer_norm_eps": 1e-06,
        "num_attention_heads": 16,
        "num_channels": 3,
        "num_hidden_layers": 27,
        "num_patches": 256,
        "patch_size": 16,
        "torch_dtype": "float32",
        "output_attentions": false,
        "output_hidden_states": false,
        "use_return_dict": true
    },
    "vit_processor": {
        "do_convert_rgb": null,
        "do_normalize": true,
        "do_rescale": true,
        "do_resize": true,
        "image_mean": [
            0.5,
            0.5,
            0.5
        ],
        "image_processor_type": "Siglip2ImageProcessorFast",
        "image_std": [
            0.5,
            0.5,
            0.5
        ],
        "max_num_patches": 1024,
        "patch_size": 16,
        "processor_class": "Siglip2Processor",
        "resample": 2,
        "rescale_factor": 0.00392156862745098
    },
    "vit_aligner": {
        "projector_type": "mlp_gelu",
        "input_dim": 1152,
        "n_embed": 4096,
        "depth": 2,
        "torch_dtype": "float32"
    }
}
