{
  "architectures": [
    "VoxtralForConditionalGeneration"
  ],
  "audio_config": {
    "activation_dropout": 0.0,
    "activation_function": "gelu",
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "head_dim": 64,
    "hidden_size": 1280,
    "initializer_range": 0.02,
    "intermediate_size": 5120,
    "layerdrop": 0.0,
    "max_source_positions": 1500,
    "model_type": "voxtral_encoder",
    "num_attention_heads": 20,
    "num_hidden_layers": 32,
    "num_key_value_heads": 20,
    "num_mel_bins": 128,
    "scale_embedding": false,
    "vocab_size": 51866
  },
  "audio_token_id": 24,
  "hidden_size": 3072,
  "model_type": "voxtral",
  "projector_hidden_act": "gelu",
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 3072,
    "initializer_range": 0.02,
    "intermediate_size": 8192,
    "max_position_embeddings": 131072,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 30,
    "num_key_value_heads": 8,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 100000000.0,
    "sliding_window": null,
    "use_cache": true,
    "vocab_size": 131072
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.54.0.dev0",
  "vocab_size": 131072
}
