{
  "architectures": [
    "Ministral3ForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "dtype": "bfloat16",
  "eos_token_id": 2,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 12288,
  "initializer_range": 0.02,
  "intermediate_size": 28672,
  "max_position_embeddings": 262144,
  "model_type": "ministral3",
  "num_attention_heads": 96,
  "num_hidden_layers": 88,
  "num_key_value_heads": 8,
  "pad_token_id": 11,
  "quantization_config": {
    "activation_scheme": "static",
    "dequantize": false,
    "modules_to_not_convert": [
      "model.vision_tower",
      "model.multi_modal_projector",
      "lm_head"
    ],
    "quant_method": "fp8",
    "weight_block_size": null
  },
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "beta_fast": 4.0,
    "beta_slow": 1.0,
    "factor": 64.0,
    "mscale": 1.0,
    "mscale_all_dim": 0.0,
    "original_max_position_embeddings": 4096,
    "llama_4_scaling_beta": 0.0,
    "rope_theta": 1000000.0,
    "rope_type": "yarn",
    "type": "yarn"
  },
  "sliding_window": null,
  "tie_word_embeddings": false,
  "transformers_version": "5.0.0.dev0",
  "use_cache": true,
  "vocab_size": 131072
}
