#loc1 = loc("p0.1")
#loc2 = loc("p1.5")
#loc3 = loc("p2.9")
#loc4 = loc("p3.13")
#loc5 = loc("p4.17")
#loc6 = loc("p5.21")
#loc7 = loc("p6.31")
#loc8 = loc("p7.35")
#loc9 = loc("p8.40")
#loc10 = loc("p9.50")
#loc11 = loc("p10.54")
#loc12 = loc("p11.58")
#loc13 = loc("p12.62")
#loc14 = loc("p13.66")
#loc15 = loc("p14.68")
#loc16 = loc("p15.72")
#loc17 = loc("p16.76")
#loc18 = loc("p17.80")
#loc19 = loc("p18.84")
#loc20 = loc("p19.86")
#loc21 = loc("p20.90")
#loc22 = loc("p21.94")
#loc23 = loc("p22.98")
#loc24 = loc("p23.102")
#loc25 = loc("p24.104")
#loc26 = loc("p25.136")
#loc27 = loc("p26.140")
#loc28 = loc("p27.144")
#loc29 = loc("p28.148")
#loc30 = loc("p29.152")
#loc31 = loc("p30.156")
#loc32 = loc("p31.166")
#loc33 = loc("p32.170")
#loc34 = loc("p33.183")
#loc35 = loc("p34.187")
#loc36 = loc("p35.191")
#loc37 = loc("p36.195")
#loc38 = loc("p37.199")
#loc39 = loc("p38.201")
#loc40 = loc("p39.205")
#loc41 = loc("p40.209")
#loc42 = loc("p41.213")
#loc43 = loc("p42.217")
#loc44 = loc("p43.219")
#loc45 = loc("p44.223")
#loc46 = loc("p45.227")
#loc47 = loc("p46.231")
#loc48 = loc("p47.235")
#loc49 = loc("p48.237")
#loc50 = loc("p49.269")
#loc51 = loc("p50.354")
#loc52 = loc("p51.358")
#loc53 = loc("p52.362")
#loc54 = loc("p53.366")
#loc55 = loc("p54.370")
#loc56 = loc("p55.476")
#loc57 = loc("p56.480")
#loc58 = loc("p57.484")
#loc59 = loc("p58.488")
#loc60 = loc("p59.492")
#loc61 = loc("p60.515")
#loc62 = loc("p61.519")
#loc63 = loc("p62.523")
#loc64 = loc("p63.527")
#loc65 = loc("p64.531")
#loc66 = loc("p65.535")
#loc67 = loc("p66.545")
#loc68 = loc("p67.549")
#loc69 = loc("p68.562")
#loc70 = loc("p69.566")
#loc71 = loc("p70.570")
#loc72 = loc("p71.574")
#loc73 = loc("p72.578")
#loc74 = loc("p73.580")
#loc75 = loc("p74.584")
#loc76 = loc("p75.588")
#loc77 = loc("p76.592")
#loc78 = loc("p77.596")
#loc79 = loc("p78.598")
#loc80 = loc("p79.602")
#loc81 = loc("p80.606")
#loc82 = loc("p81.610")
#loc83 = loc("p82.614")
#loc84 = loc("p83.616")
#loc85 = loc("p84.620")
#loc86 = loc("p85.624")
#loc87 = loc("p86.628")
#loc88 = loc("p87.632")
#loc89 = loc("p88.719")
#loc90 = loc("p89.723")
#loc91 = loc("p90.727")
#loc92 = loc("p91.731")
#loc93 = loc("p92.735")
#loc94 = loc("p93.758")
#loc95 = loc("p94.762")
#loc96 = loc("p95.766")
#loc97 = loc("p96.770")
#loc98 = loc("p97.774")
#loc99 = loc("p98.778")
#loc100 = loc("p99.788")
#loc101 = loc("p100.792")
#loc102 = loc("p101.805")
#loc103 = loc("p102.809")
#loc104 = loc("p103.813")
#loc105 = loc("p104.817")
#loc106 = loc("p105.821")
#loc107 = loc("p106.823")
#loc108 = loc("p107.827")
#loc109 = loc("p108.831")
#loc110 = loc("p109.835")
#loc111 = loc("p110.839")
#loc112 = loc("p111.841")
#loc113 = loc("p112.845")
#loc114 = loc("p113.849")
#loc115 = loc("p114.853")
#loc116 = loc("p115.857")
#loc117 = loc("p116.859")
#loc118 = loc("p117.863")
#loc119 = loc("p118.867")
#loc120 = loc("p119.871")
#loc121 = loc("p120.875")
#loc122 = loc("p121.962")
#loc123 = loc("p122.966")
#loc124 = loc("p123.970")
#loc125 = loc("p124.974")
#loc126 = loc("p125.978")
module @SyncTensorsGraph.1002 attributes {mhlo.cross_program_prefetches = [], mhlo.input_output_alias = [], mhlo.is_dynamic = false, mhlo.use_auto_spmd_partitioning = false} {
  func.func @main(%arg0: tensor<128xbf16> loc("p0.1"), %arg1: tensor<128xbf16> loc("p1.5"), %arg2: tensor<128xbf16> loc("p2.9"), %arg3: tensor<128xbf16> loc("p3.13"), %arg4: tensor<128x256x1x1xbf16> loc("p4.17"), %arg5: tensor<2xbf16> loc("p5.21"), %arg6: tensor<64xbf16> loc("p6.31"), %arg7: tensor<64x512xbf16> loc("p7.35"), %arg8: tensor<1x3x512xbf16> loc("p8.40"), %arg9: tensor<64xbf16> loc("p9.50"), %arg10: tensor<64xbf16> loc("p10.54"), %arg11: tensor<64xbf16> loc("p11.58"), %arg12: tensor<64xbf16> loc("p12.62"), %arg13: tensor<64x64x3x3xbf16> loc("p13.66"), %arg14: tensor<64xbf16> loc("p14.68"), %arg15: tensor<64xbf16> loc("p15.72"), %arg16: tensor<64xbf16> loc("p16.76"), %arg17: tensor<64xbf16> loc("p17.80"), %arg18: tensor<64x64x3x3xbf16> loc("p18.84"), %arg19: tensor<128xbf16> loc("p19.86"), %arg20: tensor<128xbf16> loc("p20.90"), %arg21: tensor<128xbf16> loc("p21.94"), %arg22: tensor<128xbf16> loc("p22.98"), %arg23: tensor<128x384x1x1xbf16> loc("p23.102"), %arg24: tensor<1x128x80x80xbf16> loc("p24.104"), %arg25: tensor<256xbf16> loc("p25.136"), %arg26: tensor<256xbf16> loc("p26.140"), %arg27: tensor<256xbf16> loc("p27.144"), %arg28: tensor<256xbf16> loc("p28.148"), %arg29: tensor<256x512x1x1xbf16> loc("p29.152"), %arg30: tensor<4xbf16> loc("p30.156"), %arg31: tensor<128xbf16> loc("p31.166"), %arg32: tensor<128x512xbf16> loc("p32.170"), %arg33: tensor<128xbf16> loc("p33.183"), %arg34: tensor<128xbf16> loc("p34.187"), %arg35: tensor<128xbf16> loc("p35.191"), %arg36: tensor<128xbf16> loc("p36.195"), %arg37: tensor<128x128x3x3xbf16> loc("p37.199"), %arg38: tensor<128xbf16> loc("p38.201"), %arg39: tensor<128xbf16> loc("p39.205"), %arg40: tensor<128xbf16> loc("p40.209"), %arg41: tensor<128xbf16> loc("p41.213"), %arg42: tensor<128x128x3x3xbf16> loc("p42.217"), %arg43: tensor<256xbf16> loc("p43.219"), %arg44: tensor<256xbf16> loc("p44.223"), %arg45: tensor<256xbf16> loc("p45.227"), %arg46: tensor<256xbf16> loc("p46.231"), %arg47: tensor<256x768x1x1xbf16> loc("p47.235"), %arg48: tensor<1x256x40x40xbf16> loc("p48.237"), %arg49: tensor<1x512x20x20xbf16> loc("p49.269"), %arg50: tensor<128xbf16> loc("p50.354"), %arg51: tensor<128xbf16> loc("p51.358"), %arg52: tensor<128xbf16> loc("p52.362"), %arg53: tensor<128xbf16> loc("p53.366"), %arg54: tensor<128x128x3x3xbf16> loc("p54.370"), %arg55: tensor<64xbf16> loc("p55.476"), %arg56: tensor<64xbf16> loc("p56.480"), %arg57: tensor<64xbf16> loc("p57.484"), %arg58: tensor<64xbf16> loc("p58.488"), %arg59: tensor<64x64x3x3xbf16> loc("p59.492"), %arg60: tensor<256xbf16> loc("p60.515"), %arg61: tensor<256xbf16> loc("p61.519"), %arg62: tensor<256xbf16> loc("p62.523"), %arg63: tensor<256xbf16> loc("p63.527"), %arg64: tensor<256x512x1x1xbf16> loc("p64.531"), %arg65: tensor<4xbf16> loc("p65.535"), %arg66: tensor<128xbf16> loc("p66.545"), %arg67: tensor<128x512xbf16> loc("p67.549"), %arg68: tensor<128xbf16> loc("p68.562"), %arg69: tensor<128xbf16> loc("p69.566"), %arg70: tensor<128xbf16> loc("p70.570"), %arg71: tensor<128xbf16> loc("p71.574"), %arg72: tensor<128x128x3x3xbf16> loc("p72.578"), %arg73: tensor<128xbf16> loc("p73.580"), %arg74: tensor<128xbf16> loc("p74.584"), %arg75: tensor<128xbf16> loc("p75.588"), %arg76: tensor<128xbf16> loc("p76.592"), %arg77: tensor<128x128x3x3xbf16> loc("p77.596"), %arg78: tensor<256xbf16> loc("p78.598"), %arg79: tensor<256xbf16> loc("p79.602"), %arg80: tensor<256xbf16> loc("p80.606"), %arg81: tensor<256xbf16> loc("p81.610"), %arg82: tensor<256x384x1x1xbf16> loc("p82.614"), %arg83: tensor<128xbf16> loc("p83.616"), %arg84: tensor<128xbf16> loc("p84.620"), %arg85: tensor<128xbf16> loc("p85.624"), %arg86: tensor<128xbf16> loc("p86.628"), %arg87: tensor<128x128x3x3xbf16> loc("p87.632"), %arg88: tensor<128xbf16> loc("p88.719"), %arg89: tensor<128xbf16> loc("p89.723"), %arg90: tensor<128xbf16> loc("p90.727"), %arg91: tensor<128xbf16> loc("p91.731"), %arg92: tensor<128x128x3x3xbf16> loc("p92.735"), %arg93: tensor<512xbf16> loc("p93.758"), %arg94: tensor<512xbf16> loc("p94.762"), %arg95: tensor<512xbf16> loc("p95.766"), %arg96: tensor<512xbf16> loc("p96.770"), %arg97: tensor<512x1024x1x1xbf16> loc("p97.774"), %arg98: tensor<8xbf16> loc("p98.778"), %arg99: tensor<256xbf16> loc("p99.788"), %arg100: tensor<256x512xbf16> loc("p100.792"), %arg101: tensor<256xbf16> loc("p101.805"), %arg102: tensor<256xbf16> loc("p102.809"), %arg103: tensor<256xbf16> loc("p103.813"), %arg104: tensor<256xbf16> loc("p104.817"), %arg105: tensor<256x256x3x3xbf16> loc("p105.821"), %arg106: tensor<256xbf16> loc("p106.823"), %arg107: tensor<256xbf16> loc("p107.827"), %arg108: tensor<256xbf16> loc("p108.831"), %arg109: tensor<256xbf16> loc("p109.835"), %arg110: tensor<256x256x3x3xbf16> loc("p110.839"), %arg111: tensor<512xbf16> loc("p111.841"), %arg112: tensor<512xbf16> loc("p112.845"), %arg113: tensor<512xbf16> loc("p113.849"), %arg114: tensor<512xbf16> loc("p114.853"), %arg115: tensor<512x768x1x1xbf16> loc("p115.857"), %arg116: tensor<256xbf16> loc("p116.859"), %arg117: tensor<256xbf16> loc("p117.863"), %arg118: tensor<256xbf16> loc("p118.867"), %arg119: tensor<256xbf16> loc("p119.871"), %arg120: tensor<256x256x3x3xbf16> loc("p120.875"), %arg121: tensor<256xbf16> loc("p121.962"), %arg122: tensor<256xbf16> loc("p122.966"), %arg123: tensor<256xbf16> loc("p123.970"), %arg124: tensor<256xbf16> loc("p124.974"), %arg125: tensor<256x256x3x3xbf16> loc("p125.978")) -> (tensor<1x128x80x80xbf16>, tensor<1x256x40x40xbf16>, tensor<1x512x20x20xbf16>) {
    %cst = stablehlo.constant dense<5.656250e+00> : tensor<1x8x20x20xbf16> loc(#loc)
    %cst_0 = stablehlo.constant dense<5.656250e+00> : tensor<1x2x80x80xbf16> loc(#loc)
    %cst_1 = stablehlo.constant dense<[0.000000e+00, 5.000000e-01, 1.000000e+00, 1.500000e+00, 2.000000e+00, 2.500000e+00, 3.000000e+00, 3.500000e+00, 4.000000e+00, 4.500000e+00, 5.000000e+00, 5.500000e+00, 6.000000e+00, 6.500000e+00, 7.000000e+00, 7.500000e+00, 8.000000e+00, 8.500000e+00, 9.000000e+00, 9.500000e+00, 1.000000e+01, 1.050000e+01, 1.100000e+01, 1.150000e+01, 1.200000e+01, 1.250000e+01, 1.300000e+01, 1.350000e+01, 1.400000e+01, 1.450000e+01, 1.500000e+01, 1.550000e+01, 1.600000e+01, 1.650000e+01, 1.700000e+01, 1.750000e+01, 1.800000e+01, 1.850000e+01, 1.900000e+01, 1.950000e+01, 2.000000e+01, 2.050000e+01, 2.100000e+01, 2.150000e+01, 2.200000e+01, 2.250000e+01, 2.300000e+01, 2.350000e+01, 2.400000e+01, 2.450000e+01, 2.500000e+01, 2.550000e+01, 2.600000e+01, 2.650000e+01, 2.700000e+01, 2.750000e+01, 2.800000e+01, 2.850000e+01, 2.900000e+01, 2.950000e+01, 3.000000e+01, 3.050000e+01, 3.100000e+01, 3.150000e+01, 3.200000e+01, 3.250000e+01, 3.300000e+01, 3.350000e+01, 3.400000e+01, 3.450000e+01, 3.500000e+01, 3.550000e+01, 3.600000e+01, 3.650000e+01, 3.700000e+01, 3.750000e+01, 3.800000e+01, 3.850000e+01, 3.900000e+01, 3.950000e+01]> : tensor<80xf64> loc(#loc)
    %cst_2 = stablehlo.constant dense<5.656250e+00> : tensor<1x4x40x40xbf16> loc(#loc)
    %cst_3 = stablehlo.constant dense<[0.000000e+00, 5.000000e-01, 1.000000e+00, 1.500000e+00, 2.000000e+00, 2.500000e+00, 3.000000e+00, 3.500000e+00, 4.000000e+00, 4.500000e+00, 5.000000e+00, 5.500000e+00, 6.000000e+00, 6.500000e+00, 7.000000e+00, 7.500000e+00, 8.000000e+00, 8.500000e+00, 9.000000e+00, 9.500000e+00, 1.000000e+01, 1.050000e+01, 1.100000e+01, 1.150000e+01, 1.200000e+01, 1.250000e+01, 1.300000e+01, 1.350000e+01, 1.400000e+01, 1.450000e+01, 1.500000e+01, 1.550000e+01, 1.600000e+01, 1.650000e+01, 1.700000e+01, 1.750000e+01, 1.800000e+01, 1.850000e+01, 1.900000e+01, 1.950000e+01]> : tensor<40xf64> loc(#loc)
    %c = stablehlo.constant dense<[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39]> : tensor<40xi64> loc(#loc)
    %cst_4 = stablehlo.constant dense<0xFF80> : tensor<bf16> loc(#loc)
    %c_5 = stablehlo.constant dense<[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]> : tensor<20xi64> loc(#loc)
    %0 = stablehlo.reshape %arg43 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc127)
    %1 = stablehlo.custom_call @tt.mark_argument(%0) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_main_conv_batch_norm2d_running_var"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc128)
    %2 = stablehlo.reshape %1 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc129)
    %3 = stablehlo.reshape %arg38 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc130)
    %4 = stablehlo.custom_call @tt.mark_argument(%3) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv1_batch_norm2d_running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc131)
    %5 = stablehlo.reshape %4 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc132)
    %6 = stablehlo.reshape %arg33 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc133)
    %7 = stablehlo.custom_call @tt.mark_argument(%6) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv2_batch_norm2d_running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc134)
    %8 = stablehlo.reshape %7 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc135)
    %9 = stablehlo.custom_call @tt.mark_argument(%arg49) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "input", ttir.name = "args_2"}} : (tensor<1x512x20x20xbf16>) -> tensor<1x512x20x20xbf16> loc(#loc136)
    %10 = stablehlo.transpose %9, dims = [0, 1, 3, 2] {result_layout = dense<[2, 3, 1, 0]> : tensor<4xindex>, xla_shape = "bf16[1,512,20,20]{2,3,1,0}"} : (tensor<1x512x20x20xbf16>) -> tensor<1x512x20x20xbf16> loc(#loc137)
    %11 = stablehlo.floor %cst_3 : tensor<40xf64> loc(#loc138)
    %12 = stablehlo.convert %11 : (tensor<40xf64>) -> tensor<40xi64> loc(#loc139)
    %13 = stablehlo.broadcast_in_dim %12, dims = [0] : (tensor<40xi64>) -> tensor<40x20xi64> loc(#loc140)
    %14 = stablehlo.broadcast_in_dim %c_5, dims = [1] : (tensor<20xi64>) -> tensor<40x20xi64> loc(#loc141)
    %15 = stablehlo.compare  EQ, %13, %14 : (tensor<40x20xi64>, tensor<40x20xi64>) -> tensor<40x20xi1> loc(#loc142)
    %16 = stablehlo.convert %15 : (tensor<40x20xi1>) -> tensor<40x20xi64> loc(#loc143)
    %17 = stablehlo.transpose %16, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "s64[20,40]{0,1}"} : (tensor<40x20xi64>) -> tensor<20x40xi64> loc(#loc144)
    %18 = stablehlo.convert %17 {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[20,40]{0,1}"} : (tensor<20x40xi64>) -> tensor<20x40xbf16> loc(#loc145)
    %19 = stablehlo.dot_general %10, %18, contracting_dims = [3] x [0] {mhlo.frontend_attributes = {grad_x = "false", grad_y = "false"}} : (tensor<1x512x20x20xbf16>, tensor<20x40xbf16>) -> tensor<1x512x20x40xbf16> loc(#loc146)
    %20 = stablehlo.transpose %19, dims = [0, 1, 3, 2] {result_layout = dense<[2, 3, 1, 0]> : tensor<4xindex>, xla_shape = "bf16[1,512,40,20]{2,3,1,0}"} : (tensor<1x512x20x40xbf16>) -> tensor<1x512x40x20xbf16> loc(#loc147)
    %21 = stablehlo.dot_general %20, %18, contracting_dims = [3] x [0] {mhlo.frontend_attributes = {grad_x = "false", grad_y = "false"}} : (tensor<1x512x40x20xbf16>, tensor<20x40xbf16>) -> tensor<1x512x40x40xbf16> loc(#loc148)
    %22 = stablehlo.custom_call @tt.mark_argument(%arg48) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "input", ttir.name = "args_1"}} : (tensor<1x256x40x40xbf16>) -> tensor<1x256x40x40xbf16> loc(#loc149)
    %23 = stablehlo.concatenate %21, %22, dim = 1 : (tensor<1x512x40x40xbf16>, tensor<1x256x40x40xbf16>) -> tensor<1x768x40x40xbf16> loc(#loc150)
    %24 = stablehlo.custom_call @tt.mark_argument(%arg47) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_main_conv_conv_weight"}} : (tensor<256x768x1x1xbf16>) -> tensor<256x768x1x1xbf16> loc(#loc151)
    %25 = stablehlo.convolution(%23, %24) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x768x40x40xbf16>, tensor<256x768x1x1xbf16>) -> tensor<1x256x40x40xbf16> loc(#loc152)
    %26 = stablehlo.reshape %arg46 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc153)
    %27 = stablehlo.custom_call @tt.mark_argument(%26) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_main_conv_batch_norm2d_weight"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc154)
    %28 = stablehlo.reshape %27 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc155)
    %29 = stablehlo.reshape %arg45 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc156)
    %30 = stablehlo.custom_call @tt.mark_argument(%29) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_main_conv_batch_norm2d_bias"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc157)
    %31 = stablehlo.reshape %30 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc158)
    %32 = stablehlo.reshape %arg44 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc159)
    %33 = stablehlo.custom_call @tt.mark_argument(%32) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_main_conv_batch_norm2d_running_mean"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc160)
    %34 = stablehlo.reshape %33 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc161)
    %35 = "stablehlo.batch_norm_inference"(%25, %28, %31, %34, %2) <{epsilon = 1.000000e-03 : f32, feature_index = 1 : i64}> : (tensor<1x256x40x40xbf16>, tensor<256xbf16>, tensor<256xbf16>, tensor<256xbf16>, tensor<256xbf16>) -> tensor<1x256x40x40xbf16> loc(#loc162)
    %36 = stablehlo.logistic %35 : tensor<1x256x40x40xbf16> loc(#loc163)
    %37 = stablehlo.multiply %35, %36 : tensor<1x256x40x40xbf16> loc(#loc164)
    %38 = stablehlo.slice %37 [0:1, 128:256, 0:40, 0:40] : (tensor<1x256x40x40xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc165)
    %39 = stablehlo.custom_call @tt.mark_argument(%arg42) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv1_conv_weight"}} : (tensor<128x128x3x3xbf16>) -> tensor<128x128x3x3xbf16> loc(#loc166)
    %40 = stablehlo.convolution(%38, %39) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x40x40xbf16>, tensor<128x128x3x3xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc167)
    %41 = stablehlo.reshape %arg41 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc168)
    %42 = stablehlo.custom_call @tt.mark_argument(%41) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv1_batch_norm2d_weight"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc169)
    %43 = stablehlo.reshape %42 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc170)
    %44 = stablehlo.reshape %arg40 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc171)
    %45 = stablehlo.custom_call @tt.mark_argument(%44) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv1_batch_norm2d_bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc172)
    %46 = stablehlo.reshape %45 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc173)
    %47 = stablehlo.reshape %arg39 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc174)
    %48 = stablehlo.custom_call @tt.mark_argument(%47) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv1_batch_norm2d_running_mean"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc175)
    %49 = stablehlo.reshape %48 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc176)
    %50 = "stablehlo.batch_norm_inference"(%40, %43, %46, %49, %5) <{epsilon = 1.000000e-03 : f32, feature_index = 1 : i64}> : (tensor<1x128x40x40xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc177)
    %51 = stablehlo.logistic %50 : tensor<1x128x40x40xbf16> loc(#loc178)
    %52 = stablehlo.multiply %50, %51 : tensor<1x128x40x40xbf16> loc(#loc179)
    %53 = stablehlo.custom_call @tt.mark_argument(%arg37) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv2_conv_weight"}} : (tensor<128x128x3x3xbf16>) -> tensor<128x128x3x3xbf16> loc(#loc180)
    %54 = stablehlo.convolution(%52, %53) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x40x40xbf16>, tensor<128x128x3x3xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc181)
    %55 = stablehlo.reshape %arg36 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc182)
    %56 = stablehlo.custom_call @tt.mark_argument(%55) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv2_batch_norm2d_weight"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc183)
    %57 = stablehlo.reshape %56 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc184)
    %58 = stablehlo.reshape %arg35 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc185)
    %59 = stablehlo.custom_call @tt.mark_argument(%58) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv2_batch_norm2d_bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc186)
    %60 = stablehlo.reshape %59 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc187)
    %61 = stablehlo.reshape %arg34 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc188)
    %62 = stablehlo.custom_call @tt.mark_argument(%61) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_blocks_0_conv2_batch_norm2d_running_mean"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc189)
    %63 = stablehlo.reshape %62 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc190)
    %64 = "stablehlo.batch_norm_inference"(%54, %57, %60, %63, %8) <{epsilon = 1.000000e-03 : f32, feature_index = 1 : i64}> : (tensor<1x128x40x40xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc191)
    %65 = stablehlo.logistic %64 : tensor<1x128x40x40xbf16> loc(#loc192)
    %66 = stablehlo.multiply %64, %65 : tensor<1x128x40x40xbf16> loc(#loc193)
    %67 = stablehlo.reshape %66 : (tensor<1x128x40x40xbf16>) -> tensor<1x4x32x40x40xbf16> loc(#loc194)
    %68 = stablehlo.custom_call @tt.mark_argument(%arg8) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "input", ttir.name = "args_3"}} : (tensor<1x3x512xbf16>) -> tensor<1x3x512xbf16> loc(#loc195)
    %69 = stablehlo.reshape %68 : (tensor<1x3x512xbf16>) -> tensor<3x512xbf16> loc(#loc196)
    %70 = stablehlo.reshape %arg32 : (tensor<128x512xbf16>) -> tensor<1x128x512xbf16> loc(#loc197)
    %71 = stablehlo.custom_call @tt.mark_argument(%70) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_attn_block_guide_fc_weight"}} : (tensor<1x128x512xbf16>) -> tensor<1x128x512xbf16> loc(#loc198)
    %72 = stablehlo.reshape %71 : (tensor<1x128x512xbf16>) -> tensor<128x512xbf16> loc(#loc199)
    %73 = stablehlo.transpose %72, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[512,128]{0,1}"} : (tensor<128x512xbf16>) -> tensor<512x128xbf16> loc(#loc200)
    %74 = stablehlo.dot_general %69, %73, contracting_dims = [1] x [0] : (tensor<3x512xbf16>, tensor<512x128xbf16>) -> tensor<3x128xbf16> loc(#loc201)
    %75 = stablehlo.reshape %74 : (tensor<3x128xbf16>) -> tensor<1x3x128xbf16> loc(#loc202)
    %76 = stablehlo.reshape %arg31 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc203)
    %77 = stablehlo.custom_call @tt.mark_argument(%76) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_attn_block_guide_fc_bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc204)
    %78 = stablehlo.reshape %77 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc205)
    %79 = stablehlo.broadcast_in_dim %78, dims = [2] : (tensor<128xbf16>) -> tensor<1x3x128xbf16> loc(#loc206)
    %80 = stablehlo.add %75, %79 : tensor<1x3x128xbf16> loc(#loc207)
    %81 = stablehlo.reshape %80 : (tensor<1x3x128xbf16>) -> tensor<1x3x4x32xbf16> loc(#loc208)
    %82 = stablehlo.dot_general %67, %81, batching_dims = [0, 1] x [0, 2], contracting_dims = [2] x [3] {mhlo.frontend_attributes = {grad_x = "false", grad_y = "false"}} : (tensor<1x4x32x40x40xbf16>, tensor<1x3x4x32xbf16>) -> tensor<1x4x40x40x3xbf16> loc(#loc209)
    %83 = stablehlo.reshape %arg50 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc210)
    %84 = stablehlo.custom_call @tt.mark_argument(%83) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_attn_block_project_conv_batch_norm2d_running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc211)
    %85 = stablehlo.reshape %84 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc212)
    %86 = stablehlo.reshape %arg25 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc213)
    %87 = stablehlo.custom_call @tt.mark_argument(%86) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_final_conv_batch_norm2d_running_var"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc214)
    %88 = stablehlo.reshape %87 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc215)
    %89 = stablehlo.reshape %arg19 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc216)
    %90 = stablehlo.custom_call @tt.mark_argument(%89) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_1_main_conv_batch_norm2d_running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc217)
    %91 = stablehlo.reshape %90 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc218)
    %92 = stablehlo.reshape %arg14 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc219)
    %93 = stablehlo.custom_call @tt.mark_argument(%92) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv1_batch_norm2d_running_var"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc220)
    %94 = stablehlo.reshape %93 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc221)
    %95 = stablehlo.reshape %arg9 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc222)
    %96 = stablehlo.custom_call @tt.mark_argument(%95) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv2_batch_norm2d_running_var"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc223)
    %97 = stablehlo.reshape %96 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc224)
    %98 = stablehlo.slice %37 [0:1, 0:128, 0:40, 0:40] : (tensor<1x256x40x40xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc225)
    %99 = stablehlo.custom_call @tt.mark_argument(%arg54) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_attn_block_project_conv_conv_weight"}} : (tensor<128x128x3x3xbf16>) -> tensor<128x128x3x3xbf16> loc(#loc226)
    %100 = stablehlo.convolution(%66, %99) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x128x40x40xbf16>, tensor<128x128x3x3xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc227)
    %101 = stablehlo.reshape %arg53 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc228)
    %102 = stablehlo.custom_call @tt.mark_argument(%101) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_attn_block_project_conv_batch_norm2d_weight"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc229)
    %103 = stablehlo.reshape %102 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc230)
    %104 = stablehlo.reshape %arg52 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc231)
    %105 = stablehlo.custom_call @tt.mark_argument(%104) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_attn_block_project_conv_batch_norm2d_bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc232)
    %106 = stablehlo.reshape %105 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc233)
    %107 = stablehlo.reshape %arg51 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc234)
    %108 = stablehlo.custom_call @tt.mark_argument(%107) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_attn_block_project_conv_batch_norm2d_running_mean"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc235)
    %109 = stablehlo.reshape %108 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc236)
    %110 = "stablehlo.batch_norm_inference"(%100, %103, %106, %109, %85) <{epsilon = 1.000000e-03 : f32, feature_index = 1 : i64}> : (tensor<1x128x40x40xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc237)
    %111 = stablehlo.reshape %110 : (tensor<1x128x40x40xbf16>) -> tensor<1x4x32x40x40xbf16> loc(#loc238)
    %112 = stablehlo.reduce(%82 init: %cst_4) applies stablehlo.maximum across dimensions = [4] : (tensor<1x4x40x40x3xbf16>, tensor<bf16>) -> tensor<1x4x40x40xbf16> loc(#loc239)
    %113 = stablehlo.divide %112, %cst_2 : tensor<1x4x40x40xbf16> loc(#loc240)
    %114 = stablehlo.reshape %arg30 : (tensor<4xbf16>) -> tensor<1x1x4xbf16> loc(#loc241)
    %115 = stablehlo.custom_call @tt.mark_argument(%114) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_attn_block_bias"}} : (tensor<1x1x4xbf16>) -> tensor<1x1x4xbf16> loc(#loc242)
    %116 = stablehlo.reshape %115 : (tensor<1x1x4xbf16>) -> tensor<1x4xbf16> loc(#loc243)
    %117 = stablehlo.broadcast_in_dim %116, dims = [0, 1] : (tensor<1x4xbf16>) -> tensor<1x4x40x40xbf16> loc(#loc244)
    %118 = stablehlo.add %113, %117 : tensor<1x4x40x40xbf16> loc(#loc245)
    %119 = stablehlo.logistic %118 : tensor<1x4x40x40xbf16> loc(#loc246)
    %120 = stablehlo.broadcast_in_dim %119, dims = [0, 1, 3, 4] : (tensor<1x4x40x40xbf16>) -> tensor<1x4x32x40x40xbf16> loc(#loc247)
    %121 = stablehlo.multiply %111, %120 : tensor<1x4x32x40x40xbf16> loc(#loc248)
    %122 = stablehlo.reshape %121 : (tensor<1x4x32x40x40xbf16>) -> tensor<1x128x40x40xbf16> loc(#loc249)
    %123 = stablehlo.concatenate %98, %38, %66, %122, dim = 1 : (tensor<1x128x40x40xbf16>, tensor<1x128x40x40xbf16>, tensor<1x128x40x40xbf16>, tensor<1x128x40x40xbf16>) -> tensor<1x512x40x40xbf16> loc(#loc250)
    %124 = stablehlo.custom_call @tt.mark_argument(%arg29) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_final_conv_conv_weight"}} : (tensor<256x512x1x1xbf16>) -> tensor<256x512x1x1xbf16> loc(#loc251)
    %125 = stablehlo.convolution(%123, %124) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x512x40x40xbf16>, tensor<256x512x1x1xbf16>) -> tensor<1x256x40x40xbf16> loc(#loc252)
    %126 = stablehlo.reshape %arg28 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc253)
    %127 = stablehlo.custom_call @tt.mark_argument(%126) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_final_conv_batch_norm2d_weight"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc254)
    %128 = stablehlo.reshape %127 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc255)
    %129 = stablehlo.reshape %arg27 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc256)
    %130 = stablehlo.custom_call @tt.mark_argument(%129) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_0_final_conv_batch_norm2d_bias"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc257)
    %131 = stablehlo.reshape %130 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc258)
    %132 = stablehlo.reshape %arg26 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc259)
    %133 = stablehlo.custom_call @tt.mark_argument(%132) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_0_final_conv_batch_norm2d_running_mean"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc260)
    %134 = stablehlo.reshape %133 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc261)
    %135 = "stablehlo.batch_norm_inference"(%125, %128, %131, %134, %88) <{epsilon = 1.000000e-03 : f32, feature_index = 1 : i64}> : (tensor<1x256x40x40xbf16>, tensor<256xbf16>, tensor<256xbf16>, tensor<256xbf16>, tensor<256xbf16>) -> tensor<1x256x40x40xbf16> loc(#loc262)
    %136 = stablehlo.logistic %135 : tensor<1x256x40x40xbf16> loc(#loc263)
    %137 = stablehlo.multiply %135, %136 : tensor<1x256x40x40xbf16> loc(#loc264)
    %138 = stablehlo.transpose %137, dims = [0, 1, 3, 2] {result_layout = dense<[2, 3, 1, 0]> : tensor<4xindex>, xla_shape = "bf16[1,256,40,40]{2,3,1,0}"} : (tensor<1x256x40x40xbf16>) -> tensor<1x256x40x40xbf16> loc(#loc265)
    %139 = stablehlo.floor %cst_1 : tensor<80xf64> loc(#loc266)
    %140 = stablehlo.convert %139 : (tensor<80xf64>) -> tensor<80xi64> loc(#loc267)
    %141 = stablehlo.broadcast_in_dim %140, dims = [0] : (tensor<80xi64>) -> tensor<80x40xi64> loc(#loc268)
    %142 = stablehlo.broadcast_in_dim %c, dims = [1] : (tensor<40xi64>) -> tensor<80x40xi64> loc(#loc269)
    %143 = stablehlo.compare  EQ, %141, %142 : (tensor<80x40xi64>, tensor<80x40xi64>) -> tensor<80x40xi1> loc(#loc270)
    %144 = stablehlo.convert %143 : (tensor<80x40xi1>) -> tensor<80x40xi64> loc(#loc271)
    %145 = stablehlo.transpose %144, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "s64[40,80]{0,1}"} : (tensor<80x40xi64>) -> tensor<40x80xi64> loc(#loc272)
    %146 = stablehlo.convert %145 {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[40,80]{0,1}"} : (tensor<40x80xi64>) -> tensor<40x80xbf16> loc(#loc273)
    %147 = stablehlo.dot_general %138, %146, contracting_dims = [3] x [0] {mhlo.frontend_attributes = {grad_x = "false", grad_y = "false"}} : (tensor<1x256x40x40xbf16>, tensor<40x80xbf16>) -> tensor<1x256x40x80xbf16> loc(#loc274)
    %148 = stablehlo.transpose %147, dims = [0, 1, 3, 2] {result_layout = dense<[2, 3, 1, 0]> : tensor<4xindex>, xla_shape = "bf16[1,256,80,40]{2,3,1,0}"} : (tensor<1x256x40x80xbf16>) -> tensor<1x256x80x40xbf16> loc(#loc275)
    %149 = stablehlo.dot_general %148, %146, contracting_dims = [3] x [0] {mhlo.frontend_attributes = {grad_x = "false", grad_y = "false"}} : (tensor<1x256x80x40xbf16>, tensor<40x80xbf16>) -> tensor<1x256x80x80xbf16> loc(#loc276)
    %150 = stablehlo.custom_call @tt.mark_argument(%arg24) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "input", ttir.name = "args_0"}} : (tensor<1x128x80x80xbf16>) -> tensor<1x128x80x80xbf16> loc(#loc277)
    %151 = stablehlo.concatenate %149, %150, dim = 1 : (tensor<1x256x80x80xbf16>, tensor<1x128x80x80xbf16>) -> tensor<1x384x80x80xbf16> loc(#loc278)
    %152 = stablehlo.custom_call @tt.mark_argument(%arg23) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_main_conv_conv_weight"}} : (tensor<128x384x1x1xbf16>) -> tensor<128x384x1x1xbf16> loc(#loc279)
    %153 = stablehlo.convolution(%151, %152) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x384x80x80xbf16>, tensor<128x384x1x1xbf16>) -> tensor<1x128x80x80xbf16> loc(#loc280)
    %154 = stablehlo.reshape %arg22 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc281)
    %155 = stablehlo.custom_call @tt.mark_argument(%154) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_main_conv_batch_norm2d_weight"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc282)
    %156 = stablehlo.reshape %155 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc283)
    %157 = stablehlo.reshape %arg21 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc284)
    %158 = stablehlo.custom_call @tt.mark_argument(%157) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_main_conv_batch_norm2d_bias"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc285)
    %159 = stablehlo.reshape %158 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc286)
    %160 = stablehlo.reshape %arg20 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc287)
    %161 = stablehlo.custom_call @tt.mark_argument(%160) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_1_main_conv_batch_norm2d_running_mean"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc288)
    %162 = stablehlo.reshape %161 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc289)
    %163 = "stablehlo.batch_norm_inference"(%153, %156, %159, %162, %91) <{epsilon = 1.000000e-03 : f32, feature_index = 1 : i64}> : (tensor<1x128x80x80xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>, tensor<128xbf16>) -> tensor<1x128x80x80xbf16> loc(#loc290)
    %164 = stablehlo.logistic %163 : tensor<1x128x80x80xbf16> loc(#loc291)
    %165 = stablehlo.multiply %163, %164 : tensor<1x128x80x80xbf16> loc(#loc292)
    %166 = stablehlo.slice %165 [0:1, 64:128, 0:80, 0:80] : (tensor<1x128x80x80xbf16>) -> tensor<1x64x80x80xbf16> loc(#loc293)
    %167 = stablehlo.custom_call @tt.mark_argument(%arg18) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv1_conv_weight"}} : (tensor<64x64x3x3xbf16>) -> tensor<64x64x3x3xbf16> loc(#loc294)
    %168 = stablehlo.convolution(%166, %167) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x80x80xbf16>, tensor<64x64x3x3xbf16>) -> tensor<1x64x80x80xbf16> loc(#loc295)
    %169 = stablehlo.reshape %arg17 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc296)
    %170 = stablehlo.custom_call @tt.mark_argument(%169) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv1_batch_norm2d_weight"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc297)
    %171 = stablehlo.reshape %170 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc298)
    %172 = stablehlo.reshape %arg16 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc299)
    %173 = stablehlo.custom_call @tt.mark_argument(%172) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv1_batch_norm2d_bias"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc300)
    %174 = stablehlo.reshape %173 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc301)
    %175 = stablehlo.reshape %arg15 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc302)
    %176 = stablehlo.custom_call @tt.mark_argument(%175) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv1_batch_norm2d_running_mean"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc303)
    %177 = stablehlo.reshape %176 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc304)
    %178 = "stablehlo.batch_norm_inference"(%168, %171, %174, %177, %94) <{epsilon = 1.000000e-03 : f32, feature_index = 1 : i64}> : (tensor<1x64x80x80xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>) -> tensor<1x64x80x80xbf16> loc(#loc305)
    %179 = stablehlo.logistic %178 : tensor<1x64x80x80xbf16> loc(#loc306)
    %180 = stablehlo.multiply %178, %179 : tensor<1x64x80x80xbf16> loc(#loc307)
    %181 = stablehlo.custom_call @tt.mark_argument(%arg13) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv2_conv_weight"}} : (tensor<64x64x3x3xbf16>) -> tensor<64x64x3x3xbf16> loc(#loc308)
    %182 = stablehlo.convolution(%180, %181) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x80x80xbf16>, tensor<64x64x3x3xbf16>) -> tensor<1x64x80x80xbf16> loc(#loc309)
    %183 = stablehlo.reshape %arg12 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc310)
    %184 = stablehlo.custom_call @tt.mark_argument(%183) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv2_batch_norm2d_weight"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc311)
    %185 = stablehlo.reshape %184 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc312)
    %186 = stablehlo.reshape %arg11 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc313)
    %187 = stablehlo.custom_call @tt.mark_argument(%186) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv2_batch_norm2d_bias"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc314)
    %188 = stablehlo.reshape %187 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc315)
    %189 = stablehlo.reshape %arg10 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc316)
    %190 = stablehlo.custom_call @tt.mark_argument(%189) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_1_blocks_0_conv2_batch_norm2d_running_mean"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc317)
    %191 = stablehlo.reshape %190 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc318)
    %192 = "stablehlo.batch_norm_inference"(%182, %185, %188, %191, %97) <{epsilon = 1.000000e-03 : f32, feature_index = 1 : i64}> : (tensor<1x64x80x80xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>, tensor<64xbf16>) -> tensor<1x64x80x80xbf16> loc(#loc319)
    %193 = stablehlo.logistic %192 : tensor<1x64x80x80xbf16> loc(#loc320)
    %194 = stablehlo.multiply %192, %193 : tensor<1x64x80x80xbf16> loc(#loc321)
    %195 = stablehlo.reshape %194 : (tensor<1x64x80x80xbf16>) -> tensor<1x2x32x80x80xbf16> loc(#loc322)
    %196 = stablehlo.reshape %arg7 : (tensor<64x512xbf16>) -> tensor<1x64x512xbf16> loc(#loc323)
    %197 = stablehlo.custom_call @tt.mark_argument(%196) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_attn_block_guide_fc_weight"}} : (tensor<1x64x512xbf16>) -> tensor<1x64x512xbf16> loc(#loc324)
    %198 = stablehlo.reshape %197 : (tensor<1x64x512xbf16>) -> tensor<64x512xbf16> loc(#loc325)
    %199 = stablehlo.transpose %198, dims = [1, 0] {result_layout = dense<[0, 1]> : tensor<2xindex>, xla_shape = "bf16[512,64]{0,1}"} : (tensor<64x512xbf16>) -> tensor<512x64xbf16> loc(#loc326)
    %200 = stablehlo.dot_general %69, %199, contracting_dims = [1] x [0] : (tensor<3x512xbf16>, tensor<512x64xbf16>) -> tensor<3x64xbf16> loc(#loc327)
    %201 = stablehlo.reshape %200 : (tensor<3x64xbf16>) -> tensor<1x3x64xbf16> loc(#loc328)
    %202 = stablehlo.reshape %arg6 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc329)
    %203 = stablehlo.custom_call @tt.mark_argument(%202) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_attn_block_guide_fc_bias"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc330)
    %204 = stablehlo.reshape %203 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc331)
    %205 = stablehlo.broadcast_in_dim %204, dims = [2] : (tensor<64xbf16>) -> tensor<1x3x64xbf16> loc(#loc332)
    %206 = stablehlo.add %201, %205 : tensor<1x3x64xbf16> loc(#loc333)
    %207 = stablehlo.reshape %206 : (tensor<1x3x64xbf16>) -> tensor<1x3x2x32xbf16> loc(#loc334)
    %208 = stablehlo.dot_general %195, %207, batching_dims = [0, 1] x [0, 2], contracting_dims = [2] x [3] {mhlo.frontend_attributes = {grad_x = "false", grad_y = "false"}} : (tensor<1x2x32x80x80xbf16>, tensor<1x3x2x32xbf16>) -> tensor<1x2x80x80x3xbf16> loc(#loc335)
    %209 = stablehlo.reshape %arg55 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc336)
    %210 = stablehlo.custom_call @tt.mark_argument(%209) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_1_attn_block_project_conv_batch_norm2d_running_var"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc337)
    %211 = stablehlo.reshape %210 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc338)
    %212 = stablehlo.reshape %arg0 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc339)
    %213 = stablehlo.custom_call @tt.mark_argument(%212) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_top_down_layers_1_final_conv_batch_norm2d_running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc340)
    %214 = stablehlo.reshape %213 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc341)
    %215 = stablehlo.reshape %arg83 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc342)
    %216 = stablehlo.custom_call @tt.mark_argument(%215) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_downsample_layers_0_batch_norm2d_running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc343)
    %217 = stablehlo.reshape %216 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc344)
    %218 = stablehlo.reshape %arg78 : (tensor<256xbf16>) -> tensor<1x1x256xbf16> loc(#loc345)
    %219 = stablehlo.custom_call @tt.mark_argument(%218) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_bottom_up_layers_0_main_conv_batch_norm2d_running_var"}} : (tensor<1x1x256xbf16>) -> tensor<1x1x256xbf16> loc(#loc346)
    %220 = stablehlo.reshape %219 : (tensor<1x1x256xbf16>) -> tensor<256xbf16> loc(#loc347)
    %221 = stablehlo.reshape %arg73 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc348)
    %222 = stablehlo.custom_call @tt.mark_argument(%221) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_bottom_up_layers_0_blocks_0_conv1_batch_norm2d_running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc349)
    %223 = stablehlo.reshape %222 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc350)
    %224 = stablehlo.reshape %arg68 : (tensor<128xbf16>) -> tensor<1x1x128xbf16> loc(#loc351)
    %225 = stablehlo.custom_call @tt.mark_argument(%224) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "constant", ttir.name = "l__self___neck_bottom_up_layers_0_blocks_0_conv2_batch_norm2d_running_var"}} : (tensor<1x1x128xbf16>) -> tensor<1x1x128xbf16> loc(#loc352)
    %226 = stablehlo.reshape %225 : (tensor<1x1x128xbf16>) -> tensor<128xbf16> loc(#loc353)
    %227 = stablehlo.slice %165 [0:1, 0:64, 0:80, 0:80] : (tensor<1x128x80x80xbf16>) -> tensor<1x64x80x80xbf16> loc(#loc354)
    %228 = stablehlo.custom_call @tt.mark_argument(%arg59) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_attn_block_project_conv_conv_weight"}} : (tensor<64x64x3x3xbf16>) -> tensor<64x64x3x3xbf16> loc(#loc355)
    %229 = stablehlo.convolution(%194, %228) dim_numbers = [b, f, 0, 1]x[o, i, 0, 1]->[b, f, 0, 1], window = {pad = [[1, 1], [1, 1]]} {batch_group_count = 1 : i64, feature_group_count = 1 : i64} : (tensor<1x64x80x80xbf16>, tensor<64x64x3x3xbf16>) -> tensor<1x64x80x80xbf16> loc(#loc356)
    %230 = stablehlo.reshape %arg58 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc357)
    %231 = stablehlo.custom_call @tt.mark_argument(%230) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_attn_block_project_conv_batch_norm2d_weight"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc358)
    %232 = stablehlo.reshape %231 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc359)
    %233 = stablehlo.reshape %arg57 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc360)
    %234 = stablehlo.custom_call @tt.mark_argument(%233) {api_version = 0 : i32, mhlo.frontend_attributes = {ttcore.argument_type = "parameter", ttir.name = "l__self___neck_top_down_layers_1_attn_block_project_conv_batch_norm2d_bias"}} : (tensor<1x1x64xbf16>) -> tensor<1x1x64xbf16> loc(#loc361)
    %235 = stablehlo.reshape %234 : (tensor<1x1x64xbf16>) -> tensor<64xbf16> loc(#loc362)
    %236 = stablehlo.reshape %arg56 : (tensor<64xbf16>) -> tensor<1x1x64xbf16> loc(#loc363)
