{
    "architectures": [
        "Phi3ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 100257,
    "embd_pdrop": 0.0,
    "eos_token_id": 100265,
    "hidden_act": "silu",
    "hidden_size": 5120,
    "initializer_range": 0.02,
    "intermediate_size": 17920,
    "max_position_embeddings": 16384,
    "model_type": "phi3",
    "num_attention_heads": 40,
    "num_hidden_layers": 40,
    "num_key_value_heads": 10,
    "original_max_position_embeddings": 16384,
    "pad_token_id": 100349,
    "resid_pdrop": 0.0,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 250000.0,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.47.0",
    "use_cache": true,
    "vocab_size": 100352
}