{
 "_name_or_path": "deepseek-ai/DeepSeek-OCR",
  "candidate_resolutions": [
  [
   1024,
   1024
  ]
 ],
 "global_view_pos": "head",
  "architectures": [
      "DeepseekOCRForCausalLM"
    ],
  "auto_map": {
    "AutoConfig": "modeling_deepseekocr.DeepseekOCRConfig",
    "AutoModel": "modeling_deepseekocr.DeepseekOCRForCausalLM"
  },
 "language_config": {
    "architectures": [
      "DeepseekV2ForCausalLM"
    ],
    "auto_map": {
      "AutoConfig": "configuration_deepseekv2.DeepseekV2Config",
      "AutoModel": "modeling_deepseek.DeepseekV2Model",
      "AutoModelForCausalLM": "modeling_deepseek.DeepseekV2ForCausalLM"
    },
    "bos_token_id": 0,
    "eos_token_id": 1,
    "first_k_dense_replace": 1,
    "hidden_size": 1280,
    "intermediate_size": 6848,
    "kv_lora_rank": null,
    "lm_head": true,
    "max_position_embeddings": 8192,
    "moe_intermediate_size": 896,
    "n_group": 1,
    "n_routed_experts": 64,
    "n_shared_experts": 2,
    "num_attention_heads": 10,
    "num_experts_per_tok": 6,
    "num_hidden_layers": 12,
    "num_key_value_heads": 10,
    "q_lora_rank": null,
    "qk_nope_head_dim": 0,
    "qk_rope_head_dim": 0,
    "rm_head": false,
    "topk_group": 1,
    "topk_method": "greedy",
    "torch_dtype": "bfloat16",
    "use_mla": false,
    "v_head_dim": 0,
    "vocab_size": 129280
  },
 "model_type": "deepseek_vl_v2",
 "projector_config": {
  "input_dim": 2048,
  "model_type": "mlp_projector",
  "n_embed": 1280,
  "projector_type": "linear"
 },
 "tile_tag": "2D",
 "torch_dtype": "bfloat16",
 "transformers_version": "4.46.3",
 "vision_config": {
  "image_size": 1024,
  "mlp_ratio": 3.7362,
  "model_name": "deeplip_b_l",
  "model_type": "vision",
  "width": {
   "clip-l-14-224": {
    "heads": 16,
    "image_size": 224,
    "layers": 24,
    "patch_size": 14,
    "width": 1024
   },
   "sam_vit_b": {
    "downsample_channels": [
     512,
     1024
    ],
    "global_attn_indexes": [
     2,
     5,
     8,
     11
    ],
    "heads": 12,
    "layers": 12,
    "width": 768
   }
  }
 },
  "bos_token_id": 0,
  "eos_token_id": 1,
  "first_k_dense_replace": 1,
  "hidden_size": 1280,
  "intermediate_size": 6848,
  "kv_lora_rank": null,
  "lm_head": true,
  "max_position_embeddings": 8192,
  "moe_intermediate_size": 896,
  "n_group": 1,
  "n_routed_experts": 64,
  "n_shared_experts": 2,
  "num_attention_heads": 10,
  "num_experts_per_tok": 6,
  "num_hidden_layers": 12,
  "num_key_value_heads": 10,
  "q_lora_rank": null,
  "qk_nope_head_dim": 0,
  "qk_rope_head_dim": 0,
  "rm_head": false,
  "topk_group": 1,
  "topk_method": "greedy",
  "use_mla": false,
  "v_head_dim": 0,
  "vocab_size": 129280
}