{
    "architectures": [
        "Phi3ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 32000,
    "hidden_act": "silu",
    "hidden_size": 3072,
    "initializer_range": 0.02,
    "intermediate_size": 8192,
    "max_position_embeddings": 131072,
    "model_type": "phi3",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "original_max_position_embeddings": 4096,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
        "long_factor": [
            1.0299999713897705, 1.0499000549316406, 1.0499000549316406, 1.0499000549316406,
            1.0499000549316406, 1.0499000549316406, 1.0499000549316406, 1.0499000549316406,
            1.0499000549316406, 1.0499000549316406, 1.0499000549316406, 1.0499000549316406,
            1.0499000549316406, 1.0499000549316406, 1.0499000549316406, 1.0499000549316406,
            1.0499000549316406, 1.0499000549316406, 1.0499000549316406, 1.0499000549316406,
            1.0499000549316406, 1.0499000549316406, 1.0499000549316406, 1.0499000549316406,
            1.0499000549316406, 1.0499000549316406, 1.0499000549316406, 1.0499000549316406,
            1.0499000549316406, 1.0499000549316406, 1.0499000549316406, 1.0499000549316406,
            1.0800000429153442, 1.0800000429153442, 1.0800000429153442, 1.0800000429153442,
            1.0800000429153442, 1.1100000143051147, 1.1100000143051147, 1.1100000143051147,
            1.1399999856948853, 1.1399999856948853, 1.1699999570846558, 1.2300000190734863,
            1.2300000190734863, 1.2300000190734863, 1.2300000190734863, 1.2300000190734863
        ],
        "short_factor": [
            1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0,
            1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0,
            1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0,
            1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0
        ],
        "type": "longrope"
    },
    "rope_theta": 10000.0,
    "sliding_window": 131072,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 32064
}
